In [131]:
import pandas as pd

In [132]:
import numpy as np

In [133]:
df = pd.read_excel (r'/Users/faaizahdesai/Desktop/me2012.xlsx', sheet_name = 'Sheet1')

In [134]:
df2 = pd.read_excel (r'/Users/faaizahdesai/Desktop/them2012.xlsx', sheet_name = '2012')

In [135]:
pd.set_option("display.max_rows", None, "display.max_columns", None)

In [136]:
df_ss1 = df.sort_values(by = ['State','School']).reset_index()

In [137]:
df_ss1.head()

,index,State,School,# Full-Time Applicants,# Part-Time Applicants,# of Offers,# of Matriculants
0,0,Alabama,Alabama,2384,0.0,543,161
1,1,Alabama,Faulkner,913,0.0,480,145
2,2,Alabama,Samford,1678,0.0,561,166
3,3,Arizona,Arizona,2035,0.0,668,157
4,4,Arizona,Arizona State,2457,0.0,590,191

In [138]:
df_ss2 = df2.sort_values(by = ['State','School']).reset_index()

In [139]:
df_ss2.head()

,index,State,School,# Full-Time Applicants,# Part-Time Applicants,# of Offers,# of Matriculants
0,0,Alabama,Alabama,2384,0.0,543,161
1,1,Alabama,Faulkner,913,0.0,480,145
2,2,Alabama,Samford,1678,0.0,561,166
3,3,Arizona,Arizona,2035,0.0,668,157
4,4,Arizona,Arizona State,2457,0.0,590,191

In [140]:
df_ss1['State2']=df_ss2['State']

In [141]:
df_ss1['School2']=df_ss2['School']

In [142]:
df_ss1['# Full-Time Applicants2']=df_ss2['# Full-Time Applicants']

In [143]:
df_ss1['# Part-Time Applicants2']=df_ss2['# Part-Time Applicants']

In [144]:
df_ss1['# of Offers2']=df_ss2['# of Offers']

In [145]:
df_ss1['# of Matriculants2']=df_ss2['# of Matriculants']

In [146]:
df_ss1.head()

,index,State,School,# Full-Time Applicants,# Part-Time Applicants,# of Offers,# of Matriculants,State2,School2,# Full-Time Applicants2,# Part-Time Applicants2,# of Offers2,# of Matriculants2
0,0,Alabama,Alabama,2384,0.0,543,161,Alabama,Alabama,2384,0.0,543,161
1,1,Alabama,Faulkner,913,0.0,480,145,Alabama,Faulkner,913,0.0,480,145
2,2,Alabama,Samford,1678,0.0,561,166,Alabama,Samford,1678,0.0,561,166
3,3,Arizona,Arizona,2035,0.0,668,157,Arizona,Arizona,2035,0.0,668,157
4,4,Arizona,Arizona State,2457,0.0,590,191,Arizona,Arizona State,2457,0.0,590,191

In [147]:
(df_ss1[df_ss1['School']!=df_ss1['School2']])

Empty DataFrame
Columns: [index, State, School, # Full-Time Applicants, # Part-Time Applicants, # of Offers, # of Matriculants, State2, School2, # Full-Time Applicants2, # Part-Time Applicants2, # of Offers2, # of Matriculants2]
Index: []

In [148]:
(df_ss1[df_ss1['# Full-Time Applicants']!=df_ss1['# Full-Time Applicants2']])

Empty DataFrame
Columns: [index, State, School, # Full-Time Applicants, # Part-Time Applicants, # of Offers, # of Matriculants, State2, School2, # Full-Time Applicants2, # Part-Time Applicants2, # of Offers2, # of Matriculants2]
Index: []

In [149]:
(df_ss1[df_ss1['# Part-Time Applicants']!=df_ss1['# Part-Time Applicants2']])

,index,State,School,# Full-Time Applicants,# Part-Time Applicants,# of Offers,# of Matriculants,State2,School2,# Full-Time Applicants2,# Part-Time Applicants2,# of Offers2,# of Matriculants2
112,112,New Jersey,Rutgers-Camden,2013,NaN,633,269,New Jersey,Rutgers-Camden,2013,NaN,633,269

In [150]:
(df_ss1[df_ss1['# of Offers']!=df_ss1['# of Offers2']])

Empty DataFrame
Columns: [index, State, School, # Full-Time Applicants, # Part-Time Applicants, # of Offers, # of Matriculants, State2, School2, # Full-Time Applicants2, # Part-Time Applicants2, # of Offers2, # of Matriculants2]
Index: []

In [151]:
(df_ss1[df_ss1['# of Matriculants']!=df_ss1['# of Matriculants2']])

Empty DataFrame
Columns: [index, State, School, # Full-Time Applicants, # Part-Time Applicants, # of Offers, # of Matriculants, State2, School2, # Full-Time Applicants2, # Part-Time Applicants2, # of Offers2, # of Matriculants2]
Index: []